{
  "backend/main.mo": "Motoko actor implementing CRUD operations for notes (with title/content) and tasks (with description/completion status), using Map data structures and auto-incrementing IDs.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: notes management system, to-do list system, cute aesthetic theme, and decorative image rendering with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend TypeScript/React components, hooks, and configuration files describing their functionality and styling approach.",
  "frontend/index.css": "Tailwind CSS base styles with custom CSS variables defining a cute aesthetic color system using OKLCH color space for light and dark themes.",
  "frontend/index.html": "HTML entry point for the React application with title 'Cute Notes' and root div mounting point.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for notes and todos pages, wrapped in a shared layout with toast notifications.",
  "frontend/src/components/AddTodoForm.tsx": "Form component for adding new tasks with decorative star icon, input field, and submit button using gradient styling and toast notifications.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper with sticky header navigation between notes/todos, gradient background, and footer with caffeine.ai attribution link.",
  "frontend/src/components/NoteCard.tsx": "Card component displaying individual notes with title/content, edit/delete buttons that appear on hover, and conditional styling for editing state.",
  "frontend/src/components/NoteEditor.tsx": "A form component for creating and editing notes with title and content fields, using mutations to save changes and displaying loading states with toast notifications.",
  "frontend/src/components/NotesList.tsx": "Displays a list of notes using NoteCard components, handles loading states, and shows an empty state message when no notes exist.",
  "frontend/src/components/TodoItem.tsx": "Renders a single task item with a checkbox to toggle completion status and a delete button, with visual styling that changes based on completion state.",
  "frontend/src/components/TodoList.tsx": "Displays all tasks grouped into incomplete and completed sections, with loading and empty states.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous actor based on Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on notes and tasks, using the actor from useActor and managing cache invalidation.",
  "frontend/src/index.css": "Global styles with Tailwind CSS, custom CSS variables for light/dark themes using OKLCH color space, and Nunito font family configuration.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/NotesPage.tsx": "Main notes page component that manages state for creating/editing notes and renders a two-column layout with NotesList and NoteEditor components, featuring a gradient header with animated cloud icon.",
  "frontend/src/pages/TodoPage.tsx": "Todo page component that renders a simple layout with an animated star icon header and displays AddTodoForm and TodoList components for task management.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, custom animations, Nunito font family, soft shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking a cute notes and to-do app with four implemented features (notes CRUD, todo list, cute aesthetic theme, and decorative images) and three pending feature requests."
}